# Data Analysis
## Class 1
### Data Cleaning and Exploratory Data Analysis
#### September 4th

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
majors = pd.read_csv("majors.csv")

In [3]:
names = pd.read_csv("names.csv")

In [4]:
majors.head()

                                        Majors Terms in Attendance
0                  Environ Health Sciences PhD                   G
1                  Molecular & Cell Biology BA                   6
2  Applied Mathematics BA, Computer Science BA                   8
3                 Electrical Eng & Comp Sci BS                   4
4                            Public Health MPH                   G

In [5]:
majors.tail()

                           Majors Terms in Attendance
1282  Letters & Sci Undeclared UG                   2
1283  Letters & Sci Undeclared UG                   6
1284  Letters & Sci Undeclared UG                   6
1285  Letters & Sci Undeclared UG                   4
1286  Letters & Sci Undeclared UG                   6

In [6]:
names.head()

    Name     Role
0    Yue  Student
1  Kevin  Student
2   Ryan  Student
3   JOHN  Student
4   Alex  Student

In [7]:
names.tail()

         Name     Role
1282      Sam  Student
1283  Shivani  Student
1284   Harjot  Student
1285  Harshil  Student
1286     Zora  Student

In [8]:
names['Name'].str.lower()

0           yue
1         kevin
2          ryan
3          john
4          alex
         ...
1282        sam
1283    shivani
1284     harjot
1285    harshil
1286       zora
Name: Name, Length: 1287, dtype: object

In [9]:
names['Name']

0           Yue
1         Kevin
2          Ryan
3          JOHN
4          Alex
         ...
1282        Sam
1283    Shivani
1284     Harjot
1285    Harshil
1286       Zora
Name: Name, Length: 1287, dtype: object

In [10]:
names['Name'] = names['Name'].str.lower()

In [11]:
names['Name']

0           yue
1         kevin
2          ryan
3          john
4          alex
         ...
1282        sam
1283    shivani
1284     harjot
1285    harshil
1286       zora
Name: Name, Length: 1287, dtype: object

In [12]:
print(len(majors))
print(len(names))

1287
1287

 Number of cells

In [13]:
majors.size

2574

Number of rows and columns

In [14]:
majors.shape

(1287, 2)

In [15]:
names['Role']

0       Student
1       Student
2       Student
3       Student
4       Student
         ...
1282    Student
1283    Student
1284    Student
1285    Student
1286    Student
Name: Role, Length: 1287, dtype: object

It counts the number of different data in a column

In [16]:
names['Role'].value_counts()

Student             1201
Waitlist Student      85
#REF!                  1
Name: Role, dtype: int64

It counts only based on the first column not all the columns

In [17]:
names.value_counts()

Name     Role
michael  Student    13
kevin    Student     9
justin   Student     8
emily    Student     8
john     Student     7
                    ..
huaxiao  Student     1
hugh     Student     1
huimei   Student     1
hyun     Student     1
zora     Student     1
Length: 989, dtype: int64

It creates a DataFrame with the information from the counts function

In [18]:
names['Role'].value_counts().to_frame()

                  Role
Student           1201
Waitlist Student    85
#REF!                1

It founds the register that have the value #REF!

In [19]:
names[names['Role'] == "#REF!"]

      Name   Role
211  #ref!  #REF!

It eliminates the #REF! register

In [20]:
names = names[names['Role'] != "#REF!"]

In [21]:
names['Role'].value_counts().to_frame()

                  Role
Student           1201
Waitlist Student    85

In [22]:
majors.columns

Index(['Majors', 'Terms in Attendance'], dtype='object')

In [23]:
majors['Terms in Attendance'].value_counts().to_frame()

       Terms in Attendance
4                      540
6                      360
8                      176
G                      134
7                       34
2                       19
5                       17
3                        6
#REF!                    1

In [24]:
majors = majors[majors['Terms in Attendance'] != "#REF!"]

In [25]:
majors['Terms in Attendance'].value_counts()

4    540
6    360
8    176
G    134
7     34
2     19
5     17
3      6
Name: Terms in Attendance, dtype: int64

In [26]:
names.describe()

           Name     Role
count      1286     1286
unique      961        2
top     michael  Student
freq         13     1201

In [27]:
majors.describe()

                             Majors Terms in Attendance
count                          1286                1286
unique                          155                   8
top     Letters & Sci Undeclared UG                   4
freq                            543                 540

In [28]:
majors['Majors'].value_counts().sort_values(ascending=True).to_frame().tail(20)

                                             Majors
Chemical Biology BS                               7
Bioengineering BS                                 7
Psychology BA                                     7
Applied Mathematics BA, Computer Science BA       7
Business Administration BS                        9
Chemical Engineering BS                          10
Info Mgmt & Systems MIMS                         10
Business Administration MBA                      10
Environ Econ & Policy BS                         10
Electrical Eng & Comp Sci MEng                   13
Applied Mathematics BA                           15
Molecular & Cell Biology BA                      18
Public Health MPH                                20
Cognitive Science BA                             27
Civil Engineering BS                             34
Electrical Eng & Comp Sci BS                     53
Economics BA                                     59
Data Science BA                                  77
Computer Science BA                              87
Letters & Sci Undeclared UG                     543

Separate the functions in rows to obtain more readability

In [30]:

majors_count = (
    majors['Majors']
    .value_counts()
    .sort_values(ascending=True)
    .to_frame()
    .tail(20)
)
majors_count

                                             Majors
Chemical Biology BS                               7
Bioengineering BS                                 7
Psychology BA                                     7
Applied Mathematics BA, Computer Science BA       7
Business Administration BS                        9
Chemical Engineering BS                          10
Info Mgmt & Systems MIMS                         10
Business Administration MBA                      10
Environ Econ & Policy BS                         10
Electrical Eng & Comp Sci MEng                   13
Applied Mathematics BA                           15
Molecular & Cell Biology BA                      18
Public Health MPH                                20
Cognitive Science BA                             27
Civil Engineering BS                             34
Electrical Eng & Comp Sci BS                     53
Economics BA                                     59
Data Science BA                                  77
Computer Science BA                              87
Letters & Sci Undeclared UG                     543